app/controllers/posts_controller.rb

  def index
    @posts = Post.paginate(:all, :page => params[:page], :order => 'created_at DESC', :per_page => 20)
---
SELECT * FROM "posts" ORDER BY created_at DESC LIMIT 10 OFFSET 0
SELECT count(*) AS count_all FROM "posts"

  def show
    @post = Post.find_by_permalink(params[:permalink])
---
SELECT * FROM "posts" WHERE ("posts"."permalink" = 'v') LIMIT 1